app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.new(params.require(:school_class).permit(:title, :room_number))
        @school_class.save
---
INSERT INTO "school_classes" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-12-16 18:20:39.462106"], ["updated_at", "2019-12-16 18:20:39.462106"]]

    def show
        @school_class = SchoolClass.find_by(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE (3) LIMIT ?  [["LIMIT", 1]]