app/controllers/students_controller.rb

INSERT INTO "students" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-12-16 18:15:14.838746"], ["updated_at", "2019-12-16 18:15:14.838746"]]
---
    def create
        @student = Student.new(params.require(:student).permit(:first_name, :last_name))
        @student.save

SELECT  "students".* FROM "students" WHERE (3) LIMIT ?  [["LIMIT", 1]]
---
    def show
        @student = Student.find_by(params[:id])